---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.UnexpectedJoinFailure
source: html/48c86080-93fd-200d-bb6e-4b887fe4581f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.UnexpectedJoinFailure Property

Join failure caused by editability or design option related problem.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnexpectedJoinFailure { get; }
```